# StructuralSectionIWelded Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionIWelded Class
Members See Also
---
Defines parameters for I-shape Welded structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionIWelded : StructuralSectionRectangular
```

Visual Basic
---
```text
Public Class StructuralSectionIWelded _
	Inherits StructuralSectionRectangular
```

Visual C++
---
```text
public ref class StructuralSectionIWelded : public StructuralSectionRectangular
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionIWelded
# See Also
StructuralSectionIWelded Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace